# 복습 num, str, bool, list
# 문자열 연산자
# + : 연결
# *: 반복
# "icd"[0] = "i" 인덱싱 연산자
#[0:5], 슬라이싱 연산자
# in 연산자 bool값 출력


# # str() 문자화
# #len() 문자의 길이나 리스트의 갯수를 돌려준다.
# coffee =["아이스아메리카노", "유자차","라떼","바닐라라떼"]
# a=len(coffee)
# print(a)

# test ="asdf".replace("df","ka")
# print(test)

#str.replace
# "megastudy".replace("mega","mini")
# b ="사과,바나나,체리".split(',')
# print(b)
# c = "사과, 바나나, 체리".split(', ')
# print(c)
# e = ",".join(['😂ㅁㄴㅇㄹ', '😅', 'd','e']) #리스트 -> 문자열
# print(e)


# py = "!".join(input("문자를 입력해주세요"))
# print(py)
# # 정답 즉 리스트화 중요함 그러나 위도 맞다. 둘다 맞음
# py = "!".join(list(input("문자를 입력해주세요")))
# print(py)



# is ~~sl?
# "a".isdigit() #숫자니?
# "b",isalnum() # 숫자 or 문자니?
# "c".islower() #소문자? upper 대문자
# ""






